app/views/photo/index.html.erb

SELECT "posts".* FROM "posts" ORDER BY created_at DESC
---
    var channel = pusher.subscribe('posts-channel');
    channel.bind('new-post', function(data) {
        let post_link = data.link;
        let post_caption = data.caption;
        let div = document.getElementById('post_section');
        let new_content = document.createElement("div");
        new_content.innerHTML = `
            <div class="post">
                <div>
                    <img class="post-image" src="${post_link}">
                </div>
                <p class="post-caption"> ${post_caption}</p>
            </div>`;
        div.insertBefore(new_content, div.firstChild);
    });