app/channels/chat_rooms_channel.rb

INSERT INTO "messages" ("body", "user_id", "chat_room_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "Hello"], ["user_id", 1], ["chat_room_id", 1], ["created_at", "2018-12-05 16:28:02.929217"], ["updated_at", "2018-12-05 16:28:02.929217"]]
---
  def send_message(data)
  current_user.messages.create!(body: data['message'], chat_room_id: data['chat_room_id'])