app/controllers/chat_rooms_controller.rb

  def index
    @chat_rooms = ChatRoom.all
---
SELECT "chat_rooms".* FROM "chat_rooms"

  def show
  @chat_room = ChatRoom.includes(:messages).find_by(id: params[:id])
---
SELECT  "chat_rooms".* FROM "chat_rooms" WHERE "chat_rooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."chat_room_id" = $1  [["chat_room_id", 1]]

  def create
    @chat_room = current_user.chat_rooms.build(chat_room_params)
    if @chat_room.save
---
INSERT INTO "chat_rooms" ("title", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "hello"], ["user_id", 1], ["created_at", "2018-12-05 16:16:29.836348"], ["updated_at", "2018-12-05 16:16:29.836348"]]