app/controllers/photo_controller.rb

INSERT INTO "posts" ("link", "caption", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def store
    # upload image to cloudinary
    @value = Cloudinary::Uploader.upload(params[:image])

    # create a new post object and save to db
    @post = Post.new({:link => @value['secure_url'], :caption => params[:caption]})

    if @post.save